{
  "id": "SjyX",
  "destination_id": 5432,
  "name": "InterContinental Singapore Robertson Quay",
  "location": {
    "address": "1 Nanson Rd, Singapore 238909",
    "city": "Singapore",
    "country": "Singapore"
  },
  "description": "Enjoy sophisticated waterfront living at the new InterContinental® Singapore Robertson Quay, luxury's preferred address nestled in the heart of Robertson Quay along the Singapore River, with the CBD just five minutes drive away. Magnifying the comforts of home, each of our 225 studios and suites features a host of thoughtful amenities that combine modernity with elegance, whilst maintaining functional practicality. The hotel also features a chic, luxurious Club InterContinental Lounge., InterContinental Singapore Robertson Quay is luxury's preferred address offering stylishly cosmopolitan riverside living for discerning travelers to Singapore. Prominently situated along the Singapore River, the 225-room inspiring luxury hotel is easily accessible to the Marina Bay Financial District, Central Business District, Orchard Road and Singapore Changi International Airport, all located a short drive away. The hotel features the latest in Club InterContinental design and service experience, and five dining options including Publico, an Italian landmark dining and entertainment destination by the waterfront.",
  "amenities": {
    "general": [
      "Pool",
      "WiFi ",
      "Aircon",
      "BusinessCenter",
      "BathTub",
      "Breakfast",
      "DryCleaning",
      "Bar",
      "outdoor pool",
      "childcare",
      "parking",
      "concierge"
    ],
    "room": [
      "aircon",
      "minibar",
      "tv",
      "bathtub",
      "hair dryer"
    ]
  },
  "images": {
    "rooms": [
      {
        "url": "https://d2ey9sqrvkqdfs.cloudfront.net/Sjym/i93_m.jpg",
        "description": "Double room"
      },
      {
        "url": "https://d2ey9sqrvkqdfs.cloudfront.net/Sjym/i94_m.jpg",
        "description": "Bathroom"
      }
    ],
    "site": [
      {
        "url": "https://d2ey9sqrvkqdfs.cloudfront.net/Sjym/i1_m.jpg",
        "description": "Restaurant"
      },
      {
        "url": "https://d2ey9sqrvkqdfs.cloudfront.net/Sjym/i2_m.jpg",
        "description": "Hotel Exterior"
      },
      {
        "url": "https://d2ey9sqrvkqdfs.cloudfront.net/Sjym/i5_m.jpg",
        "description": "Entrance"
      },
      {
        "url": "https://d2ey9sqrvkqdfs.cloudfront.net/Sjym/i24_m.jpg",
        "description": "Bar"
      }
    ]
  },
  "booking_conditions": []
}